/*
  关于java语言中的变量

  1、什么是变量
     *变量本质上来说是内存中的一块空间，这块空间有数据类型、名字、字面值。
	 *变量包含三部分：数据类型、名称、字面值
	 *变量是内存中存储数据最基本的单元

  2、数据类型的作用
     *不同的数据有不同的类型，不同的数据类型底层会分配不同大小的空间。
	 *数据类型是指导程序在运行阶段应该分配多大的内存空间。

  3、变量要求：变量中存储的具体数据“数据”必须和变量的数据类型一致，当不一致时编译器报错。

  4、声明/定义变量的语法格式
     数据类型    变量名

	 *变量名：只要是合法的标识符就行。
	 例如： 
	 int i;
	 int age;

  5、变量声明之后怎么赋值？

     语法格式：
	     变量名=字面值；
		 要求：字面值的数据类型必须和变量的数据类型一致。
		 =是一个运算符，叫做赋值运算符。
  6、声明和赋值可以放在一起完成
     int i=10;

  7、变量赋值之后可以重新赋值，变量的值可变化

     int i=10;
	 System.out.println(i)   //10
	 i=20;
	  System.out.println(i)  //20
	 i=100;
	  System.out.println(i) //100
  8、有了变量的概念后，内存空间得到了重复的使用。
  9、通常访问一种变量包含两种访问形式
     *第一种：读取变量中保存的具体数据 get/获取
	 *第二种：修改变量中保存的具体数据 set/设置

	  i=20;  //set
	  System.out.println(i) //get

  10、变量在一行上可以声明多个
      int a,b,c;

  11、变量必须先声明再赋值才能访问

*/
 public class VarTest01
 {
	 public static void main(String[] args)
	 {   //声明一个int类型的变量，起名i
		 int i;
		 i=100;//给i变量赋值，i变量在这里初始化，内存开辟。i可以重新赋值。
		 System.out.println(i);
	 }
 }