/*
  关于java中的数据类型:
     1、数据类型的作用是什么？
	    程序当中有很多数据，每一个数据都是有相关类型的，不同数据类型的数据占用空间大小不同。
	    数据类型的作用是指导JVM在运行程序的时候给该数据分配多大的内存空间。
	 2、java中的数据类型包括两种：
	    *基本数据类型

		*引用数据类型【后边讲】
		 -类
		 -接口
		 -数组
		 ...
	 3、关于基本数据类型：

	   *基本数据类型包括四大类八小种：
	      第一类：整数型
		    byte，short,int,long
		  第二类：浮点型
		    float,double
		  第三类：布尔型
		    boolean
		  第四类：字符型
            char
	 4、字符串"abc"不属于基本数据类型，属于引用数据类型。
	    *字符串使用双引号"abc"
		*字符使用单引号'a'
	 5、八种基本数据类型各自占用空间大小是多少？
	    基本数据类型         占用空间大小
		----------------------------------
		   byte                 1
		   short                2
		   int                  4
		   long                 8
		   float                4
		   double               8 
		   boolean              1
		   char                 2
	 6、计算机在任何情况下都只能识别二进制。【现代的计算机底层采用交流电的方式，即接通和断开两种状态，计算机只识别1或0，其他不认识】

	 7、什么是二进制？
	   *数据的一种表示形式。
	   例如：二进制
	    0  1  10 11 100 101 110 111 1000 1001
		0  1  2  3  4    5   6   7    8   9 
	 8、字节（byte):
	    1 byte=8 bit
	 9、整数型当中的byte类型，占用1个字节，所以byte类型的数据占用8个比特位。那么byte类别的取值范围是什么？
	    *关于java的数字类型，数字都是有正负之分的，所以在数字的二进制当中有一个二进制位被称为“符号位”。并且这个“符号位”在所有
		二进制位的最左边，0表示正数，1表示负数。
		*byte类型最大值：01111111
		【
		   00000000  00000000  00000000  10000000
		   减1结果是
		   00000000  00000000  00000000  01111111
		   】
		   *byte类型最大值是2的7次方减1，结果是127。
		   *byte类型最小值：-128
		   *byte类型取值范围：[-128,127]
		   *byte类型可以表示256个不同的数字。
	 10、二进制和十进制之间的转换规则：
	    *二进制转换成十进制
		*十进制转换成二进制：短除2求余数，余数逆序输出。
	 11、 'a'--->97 【01100001】
	      'A'--->65
		  '0'--->48
	 12、八种基本数据类型的取值范围
	      类型                   取值
		  byte                   [-128,127]
		  short                  [-32768,32767]
		  int                    [-2147483648,2147483647]
		  long
		  float
		  double
		  boolean                [true,false]
		  char                   [0,65535]
	 注意：short和char所表示的种类总数是一样的，只不过char可以表示更大的正整数。因为char没有负数。
*/
/*
 总结：
  *classpath
  *注释
  *public class和class的区别
  *标识符
  *关键字
  *字面值
  *变量
  *数据类型
 */
 /*关于八种数据类型的默认值
     数据类型                      默认值
	 ------------------------------------
 	 byte,short,int,long             0
	 float,double                    0.0
	 boolean                        false      【在C语言中true是1，false是0】
     char                           \u000
    八种数据类型的默认值一切向0看齐。

*/
 public class DataTest02
 {
	 static int k=1000;//static必须加
	 //变量还是遵守这个语法的，必须先声明，再赋值，才能访问。
	 static int f;//成员变量
	 //成员变量没有手动赋值，系统会默认赋值【局部变量不会】
	 public static void mian(String[] args)
	 {
		 /*int i;//局部变量
		 System.out.println(i);*/

		 System.out.println(k);

		 System.out.println(j);//0
	 }
 }
